'use strict';
'use client';

import React from 'react';
import { Space, Typography } from 'antd';

const {
    Text,
    Title,
    Link,
} = Typography;

import style from "./style.module.scss";
import { theme } from '../../providers/antd/theme';

const AgreementContent: React.FC = () => {
    return (
        <div className={`${style.Agreement}`}>
            <Space
                direction="vertical"
                style={{ color: theme.token.colorText }}
                className={`${style.Agreement__container} ${style.agreementContainer}`}
            >
                <Title
                    className={`${style.Agreement__containerTitle}`}
                    level={1}
                >
                    Пользовательское соглашение сайта Dessly
                </Title>
                <br/>
                <Text style={{ fontSize: theme.token.fontSizeSM }} className={`${style.Agreement__containerText}`}>
                    Редакция от «20» сентября 2024 г.
                </Text>
                <br/>
                <Text style={{ fontWeight: theme.token.fontWeightStrong }}>
                    1. Общие положения
                </Text>
                <Text>
                    <span>1.1. Настоящее Пользовательское соглашение (далее – «Соглашение») регулирует отношения между владельцем сайта dessly.net (далее – «Администрация») и пользователями сайта (далее – «Пользователи»).</span>
                    <span>1.2. Настоящее Соглашение является публичной офертой. Регистрация на сайте, покупка товаров или использование сервисов Сайта означает полное согласие Пользователя с условиями данного Соглашения.</span>
                    <span>1.3. Администрация оставляет за собой право вносить изменения в Соглашение в любое время без предварительного уведомления Пользователя. Новая версия Соглашения вступает в силу с момента ее публикации на Сайте.</span>
                </Text>
                <br/>
                <Text style={{ fontWeight: theme.token.fontWeightStrong }}>2. Права и обязанности сторон</Text>
                <Text>2.1. Права и обязанности Администрации:</Text>
                <Text>2.1.1. Администрация обязуется предоставить доступ к сервисам Сайта в соответствии с условиями
                    данного Соглашения.</Text>
                <Text>2.1.2. Администрация вправе изменять функционал Сайта, удалять и добавлять услуги, а также
                    ограничивать доступ к Сайту в случае нарушений со стороны Пользователя.</Text>
                <Text>2.1.3. Администрация не несет ответственности за сбои в работе Сайта, вызванные техническими
                    проблемами, вмешательством третьих лиц или форс-мажорными обстоятельствами.</Text>
                <Text>2.2. Права и обязанности Пользователей:</Text>
                <Text>2.2.1. Пользователь обязуется предоставлять только достоверную информацию при регистрации и
                    использовании Сайта.</Text>
                <Text>2.2.2. Пользователь обязуется не предпринимать действий, направленных на нарушение нормального
                    функционирования Сайта и сервисов.</Text>
                <Text>2.2.3. Пользователь имеет право пользоваться всеми доступными функциями Сайта и приобретать
                    предлагаемые на Сайте услуги и товары.</Text>
                <Text>2.2.4. Пользователь несет ответственность за сохранение конфиденциальности данных своей учетной
                    записи и за все действия, совершаемые под его учетной записью.</Text>
                <br/>
                <Text style={{ fontWeight: theme.token.fontWeightStrong }}>3. Регистрация и учетная запись</Text>
                <Text>3.1. Для использования всех функций Сайта, Пользователю необходимо пройти процедуру регистрации,
                    предоставив корректную и актуальную информацию.</Text>
                <Text>3.2. Администрация имеет право заблокировать учетную запись в случае нарушения условий данного
                    Соглашения или законодательства.</Text>
                <br/>
                <Text style={{ fontWeight: theme.token.fontWeightStrong }}>4. Условия предоставления услуг</Text>
                <Text>4.1. Все товары и услуги на Сайте предоставляются на условиях предоплаты.</Text>
                <Text>4.2. Оформление заказа и оплата товаров означает согласие Пользователя с условиями продажи,
                    указанными на Сайте.</Text>
                <Text>4.3. Администрация не несет ответственности за возможные убытки, понесенные Пользователем в
                    результате ошибок, технических сбоев или иных обстоятельств, вызванных действиями третьих
                    лиц.</Text>
                <br/>
                <Text style={{ fontWeight: theme.token.fontWeightStrong }}>5. Возврат и отмена заказа</Text>
                <Text>5.1. Пользователь имеет право запросить отмену заказа и возврат денежных средств в случаях,
                    предусмотренных законодательством или политикой возврата на Сайте.</Text>
                <Text>5.2. Условия возврата: Возврат денежных средств возможен в следующих случаях:</Text>
                <Text>Товар не был доставлен или услуга не была оказана.</Text>
                <Text>Товар или услуга имеют существенные недостатки, которые делают их использование невозможным.</Text>
                <Text>Пользователь обратился с запросом на возврат в течение 14 дней с момента оплаты, при условии, что товар или услуга не были использованы.</Text>
                <Text>5.3. Исключения: Возврат не производится в следующих случаях: Пользователь получил полный доступ к цифровому контенту, и он был использован.</Text>
                <Text>Возврат не предусмотрен для акционных товаров или услуг, если иное не указано в условиях акции.</Text>
                <Text>5.4. Процесс возврата: Для получения возврата Пользователь обязан связаться с Администрацией через <Link href="mailto:support@dessly.net">support@dessly.net</Link> и предоставить необходимые данные для обработки возврата.</Text>
                <Text>5.5. Возврат денежных средств осуществляется на тот же платежный метод, который использовался при оплате.</Text>
                <br/>
                <Text style={{ fontWeight: theme.token.fontWeightStrong }}>6. Ответственность сторон</Text>
                <Text>6.1. Администрация не несет ответственности за возможные убытки, причиненные Пользователю в
                    результате его использования Сайта или неспособности воспользоваться его услугами.</Text>
                <Text>6.2. Пользователь несет полную ответственность за все действия, совершенные на Сайте под его
                    учетной записью, включая действия третьих лиц, получивших доступ к учетной записи.</Text>
                <Text>6.3. Администрация не несет ответственности за контент, размещаемый пользователями на Сайте, но
                    имеет право удалять контент, нарушающий законодательство или условия Соглашения.</Text>
                <br/>
                <Text style={{ fontWeight: theme.token.fontWeightStrong }}>7. Заключительные положения</Text>
                <Text>7.1. Настоящее Соглашение регулируется законодательством страны, в которой зарегистрирован
                    владелец Сайта.</Text>
                <Text>7.2. Все споры и разногласия, возникающие в связи с выполнением данного Соглашения, решаются путем
                    переговоров. В случае невозможности достижения соглашения, споры передаются на рассмотрение в суд по
                    месту регистрации Администрации.</Text>
                <Text>7.3. Если одно или несколько положений настоящего Соглашения признаются недействительными или
                    незаконными, это не влияет на действительность остальных положений Соглашения.</Text>
                <br/>
                <Text style={{ fontWeight: theme.token.fontWeightStrong }}>8. Контактная информация</Text>
                <Text>Все вопросы, касающиеся данного Соглашения, можно направлять на электронную почту: <Link
                    href="mailto:support@dessly.net">support@dessly.net.</Link></Text>
            </Space>
        </div>
    );
};

export default AgreementContent;
