'use strict';
/* eslint-disable no-magic-numbers */

export const enum Antilopay_RequestResultCodeType {
    Success = 0,
    /* Не предоставлен идентификатор мерчанта (X-Apay-Secret-Id) */
    ErrorCode1 = 1,
    /* Неправильный идентификатор мерчанта */
    ErrorCode2 = 2,
    /* Неправильная подпись запроса */
    ErrorCode3 = 3,
    /* Проект не найден */
    ErrorCode4 = 4,
    /* Предоставленный идентификатор платежа от мерчанта уже использован */
    ErrorCode5 = 5,
    /* Проект не подтверждён */
    ErrorCode6 = 6,
    /* Нет доступных платежных шлюзов, чтобы произвести платеж */
    ErrorCode7 = 7,
    /* Мерчант не имеет разрешения на выполнение этого запроса */
    ErrorCode9 = 9,
    /* Не предоставлены данные покупателя */
    ErrorCode10 = 10,
    /* Данные покупателя должны содержать phone или email */
    ErrorCode11 = 11,
    /* Данные покупателя содержат ошибку */
    ErrorCode12 = 12,
    /* Неправильная сумма платежа */
    ErrorCode13 = 13,
    /* success_url или fail_url является некорректным HTTP-адресом */
    ErrorCode14 = 14,
    /* Ошибка в параметрах запроса */
    ErrorCode15 = 15,
    /* Ошибка в составлении JSON */
    ErrorCode16 = 16,
    /* Не предоставлена ставка НДС или недопустимое значение */
    ErrorCode17 = 17,
    /* Предоставлен недопустимый тип объекта платежа */
    ErrorCode18 = 18,
    /* Предоставлено неверное количество товара/услуг */
    ErrorCode19 = 19,
    /* Сумма должна быть больше чем указано в сообщении error */
    ErrorCode20 = 20,
    /* Проекту не назначены шлюзы */
    ErrorCode21 = 21,
    /* Данный IP адрес не имеет разрешения на обращение к API */
    ErrorCode22 = 22,
    /* Неизвестная ошибка, обратитесь в тех. поддержку */
    ErrorCode1000 = 1000,
}

/** Клиент нас пополнил */
export const enum Antilopay_PayStatusCode {
    /* Ожидание оплаты */
    PENDING = "PENDING",
    /* Платеж успешно оплачен */
    SUCCESS = "SUCCESS",
    /* Платеж не был оплачен из-за ошибки */
    FAIL = "FAIL",
    /* Платеж был отменен покупателем */
    CANCEL = "CANCEL",
    /* Не было попыток произвести оплату платежа, платеж более нельзя оплатить */
    EXPIRED = "EXPIRED",
}

/** Выводим деньги */
export const enum Antilopay_PayoutStatusCode {
    /* Ожидание проведения выплаты */
    PENDING = "PENDING",
    /* Выплата в процессе */
    WAIT_ANSWER = "WAIT_ANSWER",
    /* Выплата не была произведена по причине ошибки */
    FAIL = "FAIL",
    /* Выплата успешно завершена */
    COMPLETE = "COMPLETE",
}

export const enum Antilopay_CurrencyType {
    RUB = "RUB",
}
