'use strict';
'use client';

import React from 'react';
import { Space, Typography } from 'antd';

const {
    Text,
    Title,
    Link,
} = Typography;

import style from "./style.module.scss";
import { theme } from "../../providers/antd/theme";

const PolicyContent: React.FC = () => {
    return (
        <div className={`${style.Policy}`}>
            <Space
                direction="vertical"
                style={{ color: theme.token.colorText }}
                className={`${style.Policy__container} ${style.policyContainer}`}
            >
                <Title
                    className={`${style.Agreement__containerTitle}`}
                    level={1}
                >
                    Политика конфиденциальности сайта Dessly
                </Title>
                <br/>
                <Text style={{ fontSize: theme.token.fontSizeSM }} className={`${style.Agreement__containerText}`}>
                    Редакция от «20» сентября 2024 г.
                </Text>
                <br/>
                <Text style={{ fontWeight: theme.token.fontWeightStrong }}>
                    1. Общие положения
                </Text>
                <Text>
                    <span>1.1. Настоящая Политика конфиденциальности (далее – «Политика») разработана в соответствии с законодательством и определяет порядок обработки и защиты персональных данных пользователей сайта dessly.net (далее – «Сайт»).</span>
                    <span>1.2. Политика распространяется на всех пользователей Сайта, а также на все персональные данные, которые собираются и обрабатываются в процессе использования сайта.</span>
                    <span>1.3. Использование Сайта означает согласие пользователя с данной Политикой.</span>
                </Text>
                <br/>
                <Text style={{ fontWeight: theme.token.fontWeightStrong }}>2. Сбор персональных данных</Text>
                <Text>2.1. Мы собираем персональные данные, которые вы добровольно предоставляете при регистрации,
                    оформлении заказов, использовании сервисов Сайта или при обращении в службу поддержки.</Text>
                <br/>
                <Text style={{ fontWeight: theme.token.fontWeightStrong }}>3. Цели обработки персональных данных</Text>
                <Text>Мы обрабатываем персональные данные для следующих целей:</Text>
                <ul>
                    <li>Управление аккаунтами пользователей и предоставление услуг, связанных с покупкой игр;</li>
                    <li>Осуществление обработки заказов и выполнение финансовых транзакций;</li>
                    <li>Оказание технической поддержки;</li>
                    <li>Улучшение качества обслуживания и персонализация пользовательского опыта;</li>
                    <li>Выполнение требований законодательства.</li>
                </ul>
                <br/>
                <Text style={{ fontWeight: theme.token.fontWeightStrong }}>4. Передача данных третьим лицам</Text>
                <Text>4.1. Мы можем передавать ваши персональные данные третьим лицам в следующих случаях:</Text>
                <ul>
                    <li>Платежным системам и банкам для осуществления транзакций;</li>
                    <li>Партнерам, которые участвуют в предоставлении услуг (например, разработчикам игр);</li>
                    <li>Аналитическим сервисам для улучшения работы Сайта (Google Analytics и т.д.).</li>
                </ul>
                <Text>4.2. Мы гарантируем, что третьи лица, которым передаются данные, соблюдают высокие стандарты
                    защиты персональной информации.</Text>
                <br/>
                <Text style={{ fontWeight: theme.token.fontWeightStrong }}>5. Хранение данных</Text>
                <Text>5.1. Персональные данные пользователей хранятся не дольше, чем это необходимо для выполнения
                    целей, указанных в настоящей Политике.</Text>
                <Text>5.2. По истечении срока хранения данные будут удалены или обезличены.</Text>
                <br/>
                <Text style={{ fontWeight: theme.token.fontWeightStrong }}>6. Безопасность персональных данных</Text>
                <Text>6.1. Мы применяем современные технические и организационные меры для защиты персональных данных от
                    утраты, несанкционированного доступа, уничтожения или изменения.</Text>
                <Text>6.2. Мы постоянно обновляем наши меры безопасности, чтобы обеспечить высокий уровень защиты
                    информации.</Text>
                <br/>
                <Text style={{ fontWeight: theme.token.fontWeightStrong }}>7. Права пользователей</Text>
                <Text>Пользователи имеют право:</Text>
                <ul>
                    <li>Получать информацию о своих данных, которые обрабатываются;</li>
                    <li>Запрашивать их исправление или удаление;</li>
                    <li>Ограничивать обработку данных;</li>
                    <li>Возражать против обработки данных в определенных случаях;</li>
                    <li>Отзывать свое согласие на обработку данных.</li>
                </ul>
                <br/>
                <Text style={{ fontWeight: theme.token.fontWeightStrong }}>8. Использование файлов cookie</Text>
                <Text>8.1. На сайте используются файлы cookie для улучшения работы сайта, анализа трафика и
                    персонализации контента.</Text>
                <Text>8.2. Пользователь может настроить параметры браузера для блокировки или удаления файлов cookie, но
                    это может повлиять на функциональность Сайта.</Text>
                <br/>
                <Text style={{ fontWeight: theme.token.fontWeightStrong }}>9. Международная передача данных</Text>
                <Text>9.1. В случае необходимости передачи данных за пределы страны, мы гарантируем, что соблюдаются все
                    необходимые меры для обеспечения защиты данных в соответствии с законодательством.</Text>
                <br/>
                <Text style={{ fontWeight: theme.token.fontWeightStrong }}>10. Изменения в Политике</Text>
                <Text>10.1. Мы оставляем за собой право вносить изменения в данную Политику. В случае изменений, новая версия будет доступна на данной странице.</Text>
                <Text>10.2. Пользователи обязаны регулярно проверять Политику для отслеживания изменений.</Text>
                <br/>
                <Text style={{ fontWeight: theme.token.fontWeightStrong }}>11. Контактная информация</Text>
                <Text>В случае возникновения вопросов о политике конфиденциальности, вы можете связаться с нами по адресу: <Link href="mailto:support@dessly.net">support@dessly.net.</Link></Text>
            </Space>
        </div>
    );
};

export default PolicyContent;
